// console.log(`ДАРО Р740-10-44. 1934-1940. Метрична книга с. Коловерти.pdf
//   ДАРО Р740-15-22. 1859-1883. Метрична книга с. Біле.pdf
//   ДАРО Р740-15-23. 1861-1883. Метрична книга (шлюб) с. Біле.pdf
//   ДАРО Р740-15-24. 1884-1890. Метрична книга (народження) с. Біле.pdf
//   ДАРО Р740-15-25. 1884-1894. Метрична книга (шлюб) с. Біле.pdf
//   ДАРО Р740-16-87. 1932-1944. Метрична книга с. Застав'я.pdf
//   ДАРО Р740-6-260. 1924-1926. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-6-261. 1927-1928. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-6-262. 1929. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-6-263. 1930. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-6-264. 1931. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-6-265. 1924-1928. Метрична книга с. Коловерти.pdf
//   ДАРО Р740-7-75. 1932. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-7-76. 1933. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-7-77. 1920-1929. Метрична книга с. Коловерти.pdf
//   ДАРО Р740-7-78. 1930-1933. Метрична книга с. Коловерти.pdf
//   ДАРО Р740-8-125. 1934. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-9-146. 1935-1938. Метрична книга с. Іванівка.pdf
//   ДАРО Р740-9-39. 1892-1896. Метрична книга с. Біле.pdf`.split('\n').map(file => {
//       const [_, dates, loc] = file.match(/\.\s([\d-]+)\..+\s([іїєа-я']+)\.pdf/i) || [];
//       return `{{Архіви/справа
//    | назва = Метрична книга села ${loc}
//    | рік = ${dates}
//    | примітки = [[c:File:${file}]]
//   }}
//   [[File:${file}|thumb]]
//   `
//   }).join("\n\n"))

const WikiFormatter = () => {};

export default WikiFormatter;